<script setup lang="ts">
import type { ModalProps } from '@/utils/types/modal';
import BaseModal from './BaseModal.vue';

const props = defineProps<ModalProps>();
</script>

<template>
    <BaseModal v-bind="props">
        <div class="scrolled-info">
            Достаточно много текста... Большой пожар в Лондоне (англ. Great Fire
            of London) — пожар, охвативший центральные районы Лондона с
            воскресенья, 2 сентября, по четверг, 6 сентября, 1666 года[К 1].
            Огню подверглась территория лондонского Сити внутри древней римской
            городской стены. Пожар угрожал аристократическому району Вестминстер
            (современный Вест-Энд), дворцу Уайтхолл и большинству из пригородных
            трущоб, однако он не смог достичь этих округов[1]. В пожаре сгорело
            13 000 домов, 87 приходских больших церквей (даже собор Святого
            Павла), большая часть правительственных зданий. Считается, что пожар
            лишил крова 72 тысячи человек, при тогдашнем населении центральной
            части Лондона в 80 тысяч[2]. Точно неизвестно, сколько людей погибло
            при пожаре, есть сведения всего лишь о нескольких жертвах, но
            множество жертв не были записаны. Кроме того, огонь мог кремировать
            многих, оставляя неузнаваемые останки. Пожар начался в пекарне
            Томаса Фарринера на улочке Паддинг-лейн[англ.], вскоре после
            полуночи в воскресенье, 2 сентября. Огонь стал быстро
            распространяться по Сити в западном направлении. Пожарные того
            времени, как правило, применяли метод разрушения зданий вокруг
            возгорания для того, чтобы огонь не распространялся. Этого не
            сделали только потому, что лорд-мэр, сэр Томас Бладворт[англ.], не
            был уверен в целесообразности этих мер. К тому времени, когда он
            приказал разрушить здания, было слишком поздно. Некоторые люди
            считали, что поджог совершили иностранцы, предположительно голландцы
            или французы. Обе страны были врагами Англии во Второй
            англо-голландской войне, которая шла в то время.
        </div>
    </BaseModal>
</template>
